Revit 2027 API
ExportIFCCategoryInfo.IFCUserDefinedType Property
 The name of the user-defined type mapped to a particular Revit category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string IFCUserDefinedType { get; set; }
Public Property IFCUserDefinedType As String
	Get
	Set
public:
property String^ IFCUserDefinedType {
	String^ get ();
	void set (String^ value);
}
member IFCUserDefinedType : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExportIFCCategoryInfo Class
Autodesk.Revit.DB Namespace